/* 
   Localizable.strings
   Viscosity
 */

/* Default new connection name */
"My Connection" = "My Connection";

/* Connection status types (current and future) */
"Connected" = "Connected";
"Connecting" = "Connecting";
"Disconnected" = "Disconnected";
"Authenticating" = "Authenticating";
"Waiting" = "Waiting";
"Exiting" = "Exiting";

/* Menu item names */
"Connect %s" = "Connect %s";
"Disconnect %s" = "Disconnect %s";
"1 Active Connection" = "1 Active Connection";
"%d Active Connections" = "%d Active Connections";
"Details..." = "Details...";
"Preferences..." = "Preferences...";
"Quit Viscosity" = "Quit Viscosity";

/* Time measurement */
"day" = "day";
"days" = "days";
"hour" = "hour";
"hours" = "hours";
"minute" = "minute";
"minutes" = "minutes";
"second" = "second";
"seconds" = "seconds";

/* Add routes under Networking tab */
"The Route Could Not Be Added" = "The Route Could Not Be Added";
"You must enter a Route before saving." = "You must enter a Route before saving.";

/* Delete connection confirmation */
"Are you sure you want to delete the connection '%s'?" = "Are you sure you want to delete the connection '%s'?";

/* Select file buttons */
"Clear" = "Clear";
"Select ..." = "Select ...";

/* Generic window buttons */
"Yes" = "Yes";
"No" = "No";

/* Proxy authentication types */
"None" = "None";
"Username/Password (Basic)" = "Username/Password (Basic)";
"Username/Password (NTLM)" = "Username/Password (NTLM)";

/* Saving a connection messages */
"The Connection Could Not Be Saved" = "The Connection Could Not Be Saved";
"You must enter a Name for the connection." = "You must enter a Name for the connection.";
"The name '%s' is already in use. Please enter a new name." = "The name '%s' is already in use. Please enter a new name.";
"You must enter an address for the remote server." = "You must enter an address for the remote server.";
"You must enter an address for the proxy server." = "You must enter an address for the proxy server.";
"You must enter a port for the proxy server." = "You must enter a port for the proxy server.";

/* Exporting a connection */
"Export As:" = "Export As:";

/* Import Tunnelblick Connection Messages */
"Import Connections From Tunnelblick?" = "Import Connections From Tunnelblick?";
"An installation of Tunnelblick was detected on your computer. Would you like Viscosity to automatically import connection configurations from it?" = "An installation of Tunnelblick was detected on your computer. Would you like Viscosity to automatically import connection configurations from it?";
"No Tunnelblick Connections Imported" = "No Tunnelblick Connections Imported";
"No valid client-side Tunnelblick connections were found. But don't despair! You can use the Preferences section to manually set up or import a connection." = "No valid client-side Tunnelblick connections were found. But don't despair! You can use the Preferences section to manually set up or import a connection.";
"Tunnelblick Connection Imported" = "Tunnelblick Connection Imported";
"A connection was successfully imported from Tunnelblick. If you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure it was imported correctly." = "A connection was successfully imported from Tunnelblick. If you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure it was imported correctly.";
"%d Tunnelblick Connections Imported" = "%d Tunnelblick Connections Imported";
"%d connections were successfully imported from Tunnelblick. If you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure they were imported correctly." = "%d connections were successfully imported from Tunnelblick. If you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure they were imported correctly.";

/* About Window Label */
"Registered To" = "Registered To";

/* Registration Messages */
"Registration Successful" = "Registration Successful";
"Registration was successful. All limits have been removed. Thank you for purchasing Viscosity!" = "Registration was successful. All limits have been removed. Thank you for purchasing Viscosity!";
"Invalid License" = "Invalid License";
"The license key entered was invalid. Please check the name, email address, and license key and try again." = "The license key entered was invalid. Please check the name, email address, and license key and try again.";
"Error: Name Missing" = "Error: Name Missing";
"Please enter the name associated with the license to continue." = "Please enter the name associated with the license to continue.";
"Error: Email Missing" = "Error: Email Missing";
"Please enter the email associated with the license to continue." = "Please enter the email associated with the license to continue.";
"Error: License Missing" = "Error: License Missing";
"Please enter the license key to continue." = "Please enter the license key to continue.";

/* Popup authentication windows */
"Please log into the HTTP Proxy server using your username and password." = "Please log into the HTTP Proxy server using your username and password.";
"OpenVPN requires a username and password to continue." = "OpenVPN requires a username and password to continue.";
"Authentication Failed" = "Authentication Failed";
"The username and/or password in your keychain was incorrect. Your keychain for this connection has been reset. Please reconnect to try again." = "The username and/or password in your keychain was incorrect. Your keychain for this connection has been reset. Please reconnect to try again.";
"Authentication Failed" = "Authentication Failed";
"The username and/or password entered was incorrect. Please reconnect to try again." = "The username and/or password entered was incorrect. Please reconnect to try again.";
"Verification Failed" = "Verification Failed";
"OpenVPN Verification Failed using the details in your keychain. Your keychain for this connection has been reset. Please reconnect to try again." = "OpenVPN Verification Failed using the details in your keychain. Your keychain for this connection has been reset. Please reconnect to try again.";
"Verification Failed" = "Verification Failed";
"OpenVPN Verification Failed. Please reconnect to try again." = "OpenVPN Verification Failed. Please reconnect to try again.";

/* Log Message */
"The OpenVPN subsystem could not be started. Please check the following:\n- Check for any error messages above this notification.\n- Make sure Viscosity is not running under a File Vault protected location (put Viscosity in the Applications folder).\n- Make sure the configuration is valid. Check the connection settings for the connection using Viscosity and make sure all settings are correct." = "The OpenVPN subsystem could not be started. Please check the following:\n- Check for any error messages above this notification.\n- Make sure Viscosity is not running under a File Vault protected location (put Viscosity in the Applications folder).\n- Make sure the configuration is valid. Check the connection settings for the connection using Viscosity and make sure all settings are correct.";

/* Popup error message */
"Connection Failed" = "Connection Failed";
"The OpenVPN subsystem could not be started. Please see the log section (the third icon) in the Details window for more information." = "The OpenVPN subsystem could not be started. Please see the log section (the third icon) in the Details window for more information.";

/* Growl alerts */
"%s Is Disconnected" = "%s Is Disconnected";
"The connection %s has been disconnected." = "The connection %s has been disconnected.";
"%s Is Connected" = "%s Is Connected";
"The connection %s has connected." = "The connection %s has connected.";
"The connection %@ has connected with an IP address of %@." = "The connection %@ has connected with an IP address of %@.";

/* Admin rights required message */
"Admin Rights Required" = "Admin Rights Required";
"Viscosity requires administration rights when first launched in order to setup OpenVPN and required components. Viscosity will now exit. Please reopen Viscosity to try again." = "Viscosity requires administration rights when first launched in order to setup OpenVPN and required components. Viscosity will now exit. Please reopen Viscosity to try again.";

/* Importing connection messages */
"The Connection Could Not Be Imported" = "The Connection Could Not Be Imported";
"The file selected is not a valid client-side OpenVPN configuration file." = "The file selected is not a valid client-side OpenVPN configuration file.";
"Connection Imported" = "Connection Imported";
"Viscosity has successfully imported the connection. It is now available in your connection list." = "Viscosity has successfully imported the connection. It is now available in your connection list.";
"The Connection Could Not Be Imported" = "The Connection Could Not Be Imported";
"The file opened is not a valid Viscosity connection bundle." = "The file opened is not a valid Viscosity connection bundle.";
"Viscosity has successfully imported the connection. It is now available in your connection list.\n\nIf you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure they were imported correctly." = "Viscosity has successfully imported the connection. It is now available in your connection list.\n\nIf you have used advanced OpenVPN features or scripts please visit the Preferences section to ensure they were imported correctly.";

/* Trial period messages */
"Trial Period Expired!" = "Trial Period Expired!";
"Your trial period has expired. If you like Viscosity please purchase it for unrestricted use." = "Your trial period has expired. If you like Viscosity please purchase it for unrestricted use.";
"Please purchase Viscosity!" = "Please purchase Viscosity!";
"Your trial period expires in %d days. If you like Viscosity please purchase it for unrestricted use." = "Your trial period expires in %d days. If you like Viscosity please purchase it for unrestricted use.";
"Your trial period expires in 1 day! If you like Viscosity please purchase it for unrestricted use." = "Your trial period expires in 1 day! If you like Viscosity please purchase it for unrestricted use.";
"Quit" = "Quit";
"Enter License" = "Enter License";
"Purchase" = "Purchase";
"OK" = "OK";

/* Details window text */
"In" = "In";
"Out" = "Out";

"Bytes" = "Bytes";

/* 1.0.7 strings */
"Import Bundled Connections?" = "Import Bundled Connections?";
"This copy of Viscosity has been bundled with one or more connections. Would you like to overwrite your existing connections with the bundled connection/s, or append them to your connection list without removing your existing connection/s?" = "This copy of Viscosity has been bundled with one or more connections. Would you like to overwrite your existing connections with the bundled connection/s, or append them to your connection list without removing your existing connection/s?";
"Overwrite" = "Overwrite";
"Ignore" = "Ignore";
"Append" = "Append";

/* 1.2 strings */
"Are you sure you want to delete the folder '%s' and its %d items?" = "Are you sure you want to delete the folder '%s' and its %d items?";
"Are you sure you want to delete the folder '%s'?" = "Are you sure you want to delete the folder '%s'?";
"Delete Connection" = "Delete Connection";
"Delete Folder" = "Delete Folder";
"My Folder" = "My Folder";
"%d Items" = "%d Items";

/* Importing from a server messages */
"Invalid Remote Server Address" = "Invalid Remote Server Address";
"You must enter a valid address for the remote VPN server." = "You must enter a valid address for the remote VPN server.";
"Invalid Username" = "Invalid Username";
"You must enter a username to use for authentication." = "You must enter a username to use for authentication.";
"Connection Failed" = "Connection Failed";
"The remote server could not be contacted. Please make sure you have entered a valid server address and try again." = "The remote server could not be contacted. Please make sure you have entered a valid server address and try again.";
"Authentication Failed" = "Authentication Failed";
"The username and/or password entered were not accepted by the server. Please make sure your username and password are correct and try again." = "The username and/or password entered were not accepted by the server. Please make sure your username and password are correct and try again.";
"Viscosity can't verify the identity of the server \"%@\"." = "Viscosity can't verify the identity of the server \"%@\".";
"The certificate for this server is invalid. You might be connecting to a server that is pretending to be \"%@\", which could result in a malicious VPN configuration. Would you like to connect to the server anyway?" = "The certificate for this server is invalid. You might be connecting to a server that is pretending to be \"%@\", which could result in a malicious VPN configuration. Would you like to connect to the server anyway?";

/* 1.3 strings */
"Checking reachability status of connection..." = "Checking reachability status of connection...";
"Connection is not reachable. Disconnecting." = "Connection is not reachable. Disconnecting.";
"Connection is reachable. Starting connection attempt." = "Connection is reachable. Starting connection attempt.";

"Before Connect script terminated connection attempt." = "Before Connect script terminated connection attempt.";

"%s Could Not Be Connected" = "%s Could Not Be Connected";
"A valid network to the remote server does not exist. Please make sure your computer has a valid network connection and try again. Viscosity can leave this connection disconnected, or it can automatically connect it when a valid network becomes available." = "A valid network to the remote server does not exist. Please make sure your computer has a valid network connection and try again. Viscosity can leave this connection disconnected, or it can automatically connect it when a valid network becomes available.";
"%s Has Been Disconnected" = "%s Has Been Disconnected";
"%s has been disconnected as a valid network to the remote server no longer exists. Viscosity can leave this connection disconnected, or it can automatically reconnect it when a valid network is available again." = "%s has been disconnected as a valid network to the remote server no longer exists. Viscosity can leave this connection disconnected, or it can automatically reconnect it when a valid network is available again.";
"Several Connections Have Been Disconnected" = "Several Connections Have Been Disconnected";
"Several connections have been disconnected as a valid network to the remote servers no longer exists. Viscosity can leave these connections disconnected, or it can automatically reconnect them when a valid network is available again." = "Several connections have been disconnected as a valid network to the remote servers no longer exists. Viscosity can leave these connections disconnected, or it can automatically reconnect them when a valid network is available again.";

"OK" = "OK";
"Automatically Connect" = "Automatically Connect";

/* 1.3.1 strings */

"Reconnect Connections?" = "Reconnect Connections?";
"Viscosity must reconnect your active connections to apply this change." = "Viscosity must reconnect your active connections to apply this change.";
"Reconnect" = "Reconnect";
"Cancel" = "Cancel";

/* 1.3.5 strings */

"Allow OpenVPN-AS Script To Run?" = "Allow OpenVPN-AS Script To Run?";
"The OpenVPN-AS server you have connected to has sent Viscosity a script to run. Often such scripts are used to automatically set up your computer to properly use your VPN connection, however if you don't trust the VPN server you have connected to running the script could pose a security risk. Do you want to allow the script to run?" = "The OpenVPN-AS server you have connected to has sent Viscosity a script to run. Often such scripts are used to automatically set up your computer to properly use your VPN connection, however if you don't trust the VPN server you have connected to running the script could pose a security risk. Do you want to allow the script to run?";
"Allow" = "Allow";
"Deny" = "Deny";
"Always perform this action for this connection" = "Always perform this action for this connection";
"%s Could Not Be Connected" = "%s Could Not Be Connected";
"The certificate for this connection has expired. You will need to get in touch with your VPN Provider or system administrator to obtain a new certificate." = "The certificate for this connection has expired. You will need to get in touch with your VPN Provider or system administrator to obtain a new certificate.";

/* 1.4.2 strings */

"Enable unsafe OpenVPN commands?" = "Enable unsafe OpenVPN commands?";
"Allowing unsafe OpenVPN commands can allow an attacker with access to your computer to gain full Adminisrator (root) permissions. This would allow an attacker full access to your computer. Are you sure you wish to enable unsafe OpenVPN commands? You will need to enter an Administrator's username and password to enable this option." = "Allowing unsafe OpenVPN commands can allow an attacker with access to your computer to gain full Adminisrator (root) permissions. This would allow an attacker full access to your computer. Are you sure you wish to enable unsafe OpenVPN commands? You will need to enter an Administrator's username and password to enable this option.";
"Error: Unsafe OpenVPN command detected" = "Error: Unsafe OpenVPN command detected";
"The connection could not be started as an unsafe OpenVPN command ('%s') is present. Unsafe commands are blocked to ensure the security of your computer. Please edit your connection and remove the command from under the Advanced tab, or turn on the 'Allow Unsafe OpenVPN commands' option in the Advanced Preferences area." = "The connection could not be started as an unsafe OpenVPN command ('%s') is present. Unsafe commands are blocked to ensure the security of your computer. Please edit your connection and remove the command from under the Advanced tab, or turn on the 'Allow Unsafe OpenVPN commands' option in the Advanced Preferences area.";

/* 1.4.5 strings */
"The saved password for your PKCS#11 device was rejected. Your saved password has been reset. Multiple incorrect password attempts could potentially lock your token preventing further use. Please reconnect to try again." = "The saved password for your PKCS#11 device was rejected. Your saved password has been reset. Multiple incorrect password attempts could potentially lock your token preventing further use. Please reconnect to try again.";
"The PKCS#11 device you are attempting to use is locked. Please contact your device provider for further assistance." = "The PKCS#11 device you are attempting to use is locked. Please contact your device provider for further assistance.";

/* 1.5 strings */
"Viscosity Helper Connection Failed" = "Viscosity Helper Connection Failed";
"Viscosity was unable to connect to its helper tool and must now quit. Please ensure that Viscosity has been correctly installed and isn't being blocked by any network security software, and then reopen Viscosity to try again." = "Viscosity was unable to connect to its helper tool and must now quit. Please ensure that Viscosity has been correctly installed and isn't being blocked by any network security software, and then reopen Viscosity to try again.";
"Viscosity Helper Connection Lost" = "Viscosity Helper Connection Lost";
"Viscosity's connection to its helper tool was severed and so it must now quit. Please reopen Viscosity to try again." = "Viscosity's connection to its helper tool was severed and so it must now quit. Please reopen Viscosity to try again.";
"Viscosity Helper Tool Installation" = "Viscosity Helper Tool Installation";
"Viscosity has detected that it needs to install or update its helper tool.\n\nThe helper tool is required to allow VPN connections to be created and managed securely. It must be installed for Viscosity to function.\n\nTo proceed please click the Install button below. You will be prompted for administrator rights to authorize the install." = "Viscosity has detected that it needs to install or update its helper tool.\n\nThe helper tool is required to allow VPN connections to be created and managed securely. It must be installed for Viscosity to function.\n\nTo proceed please click the Install button below. You will be prompted for administrator rights to authorize the install.";
"Install" = "Install";
"Quit" = "Quit";
"Viscosity Helper Tool Installation Failed" = "Viscosity Helper Tool Installation Failed";
"Viscosity was unable to install its helper tool and must now quit. Please reopen Viscosity to try again." = "Viscosity was unable to install its helper tool and must now quit. Please reopen Viscosity to try again.";
"A Connection/s Could Not Be Imported" = "A Connection/s Could Not Be Imported";
"One or more connections in the folder could not be imported. All other connections (if any) have been imported successfully." = "One or more connections in the folder could not be imported. All other connections (if any) have been imported successfully.";
"Connection/s Imported" = "Connection/s Imported";
"Viscosity has sucessfully imported the connection/s. It is now available in your connection list." = "Viscosity has sucessfully imported the connection/s. It is now available in your connection list.";
"Enable" = "Enable";
